site.org
#
# The gh-pages site at 'https://j-keck.github.io/zsd
# are generated from this file
#
#+title: zsd
#+hugo_base_dir: ./doc/site
#+options: creator:t author:nil

* Index
:PROPERTIES:
:export_title: zsd
:export_file_name: _index
:export_hugo_section: /
:export_hugo_weight: 10
:export_hugo_type: docs
:END:

~zsd~ - cli tool to find older versions of a given file in your zfs snapshots.

With ~zsd~ you can

  - find older file versions in your zfs snapshots for a given file

  - view the file content from a given snapshot

  - inspect a diff from the older version to the actual version

  - revert a single change

  - restore a version from a zfs snapshot

  - grep changes

/For a browser based version see [[https://j-keck.github.io/zfs-snap-diff][zfs-snap-diff]]./

** License

~zsd~ is released under the **MIT** License.
See the [[https://github.com/j-keck/zsd/blob/master/LICENSE][license file]] for more information.


