doc/site/content/_index.md
+++
title = "zsd"
type = "docs"
draft = false
creator = "Emacs 26.3 (Org mode 9.1.9 + ox-hugo)"
weight = 10
+++

`zsd` - cli tool to find older versions of a given file in your zfs snapshots.

With `zsd` you can

-   find older file versions in your zfs snapshots for a given file

-   view the file content from a given snapshot

-   inspect a diff from the older version to the actual version

-   restore a version from a zfs snapshot

_For a browser based version see [zfs-snap-diff](https://j-keck.github.io/zfs-snap-diff)._


## License {#license}

`zsd` is released under the ****MIT**** License.
See the [license file](https://github.com/j-keck/zsd/blob/master/LICENSE) for more information.
